In [36]:
# 이상치(outlier) 걸러내기
import pandas as pd
import numpy as np

rng = np.random.RandomState(0)
data = pd.DataFrame(rng.randn(1000, 4))
data.head()

          0         1         2         3
0  1.764052  0.400157  0.978738  2.240893
1  1.867558 -0.977278  0.950088 -0.151357
2 -0.103219  0.410599  0.144044  1.454274
3  0.761038  0.121675  0.443863  0.333674
4  1.494079 -0.205158  0.313068 -0.854096

In [37]:
data.describe()
# 결과를 살펴보면 0을 기준으로 최댓값이 3, 최솟값이 -3인 것을 확인할 수 있다.

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.062966    -0.002087    -0.025777    -0.010981
std       0.983517     0.967146     0.983671     0.993891
min      -3.740101    -3.046143    -3.116857    -3.392300
25%      -0.755720    -0.683680    -0.684833    -0.686776
50%      -0.029995    -0.023210    -0.025068    -0.038192
75%       0.604792     0.652095     0.624139     0.648778
max       2.929096     2.662727     3.801660     3.427539

In [38]:
# 3보다 큰 수를 출력하고자 할 때
data[(np.abs(data) > 3).any(axis=1)]

            0         1         2         3
147 -0.392389 -3.046143  0.543312  0.439043
263 -0.156024  1.049093  3.170975  0.189500
504  0.708860  0.422819 -3.116857  0.644452
770 -0.387313 -0.347585  3.306574 -1.510200
779 -1.091033 -0.126856  3.801660  2.315171
861  0.236225 -0.752582  0.045113  3.427539
865 -0.087328 -0.553965 -3.006499 -0.047166
919 -0.953179 -0.479297 -1.345508 -3.392300
938 -3.740101  0.973577  1.175155 -1.124703

In [39]:
data[np.abs(data) > 3] = np.sign(data)*3 # sign함수 - 양수면 1, 음수면 -1, 0은 0
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.062226    -0.002041    -0.026933    -0.011016
std       0.981022     0.967002     0.978950     0.991240
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.755720    -0.683680    -0.684833    -0.686776
50%      -0.029995    -0.023210    -0.025068    -0.038192
75%       0.604792     0.652095     0.624139     0.648778
max       2.929096     2.662727     3.000000     3.000000

In [40]:
# 순열
df = pd.DataFrame(np.arange(5*4).reshape(5, 4))
sample = rng.permutation(5)
sample # 무작위로 뽑아 나열

array([3, 1, 0, 4, 2])

In [41]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [42]:
df.iloc[sample]

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [43]:
df.take(sample)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [44]:
df.sample(3) # sample 메소드, 지금 내 요소 중 샘플 3가지를 출력

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7

In [45]:
# 조금 더 작은 사이즈 예시
s1 = pd.Series([7, 3, -2, 1, 4])
s1.sample(n=10, replace = True) # replace = False가 default값이고 중복이 허용되지 않는다.

2   -2
0    7
0    7
3    1
1    3
0    7
3    1
3    1
1    3
3    1
dtype: int64

In [46]:
# 범주형 변수 - 지표, 더미로 나타낼 필요가 있다. (one-hot encoding)
df = pd.DataFrame({'keys' : ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1' : range(6)})
df

  keys  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    b      5

In [47]:
pd.get_dummies(df['keys']) # 더미형 데이터로 변환

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [48]:
# null 이름 앞에 붙을 이름을 직접 조정해줄 수 있다.
pd.get_dummies(df['keys'], prefix = 'key')

   key_a  key_b  key_c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

# 파일 열기
movies.dat -> :: 기준으로 분류, 헤더x, 헤더 - id, title, genre 추가

In [51]:
movies = pd.read_table('movies.dat', encoding = 'utf-8', sep = '::', header = None, names = ['id', 'title', 'genre'], engine = 'python')
movies.head()

   id                               title                         genre
0   1                    Toy Story (1995)   Animation|Children's|Comedy
1   2                      Jumanji (1995)  Adventure|Children's|Fantasy
2   3             Grumpier Old Men (1995)                Comedy|Romance
3   4            Waiting to Exhale (1995)                  Comedy|Drama
4   5  Father of the Bride Part II (1995)                        Comedy

In [71]:
# 영화장르를 보기 쉽게 정렬
all_genres = set()
for m in movies.genre :
    all_genres.update(m.split('|'))

np.array(list(all_genres))

array(['Animation', 'Film-Noir', 'Western', 'Thriller', "Children's",
       'Drama', 'Crime', 'Musical', 'Fantasy', 'Adventure', 'Horror',
       'Documentary', 'Romance', 'Action', 'War', 'Mystery', 'Sci-Fi',
       'Comedy'], dtype='<U11')

In [77]:
# 판다스 활용하는 방법
all_genres = [] # 빈공간 생성
for m in movies.genre : # 반복문, m이 movies.genre 파일 안에 있을 때
    all_genres.extend(m.split('|')) # 빈 리스트에 '|' 기호를 기준으로 분리(split)하여 리스트에 추가(extend)

all_genres = pd.unique(all_genres) # 중복된 장르를 제거하기 위한 코드
# pd.unique 함수를 사용하여 유일한 장르 목록을 생성한다.(영어 해석 그대로)
all_genres # 최종 all_genres 값 출력

/var/folders/mr/zpw8mcz14pj_gkyqs4k_zl4c0000gn/T/ipykernel_1214/3528778471.py:6: FutureWarning: unique with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  all_genres = pd.unique(all_genres) # 중복된 장르를 제거하기 위한 코드

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [92]:
# 더미 생성, 열에 대한 작업
dummies = pd.DataFrame(np.zeros((len(movies), len(all_genres))), columns = all_genres)
# pd.DataFrame : 데이터 프레임 형식으로 출력
# np.zeros((len(movies), len(all_genres)) : 영화의 수와 고유한 장르의 수로 이루어진 2차원 배열, zero를 사용하였음으로 0으로 초기화
# 생성된 DataFrame의 열 이름을 all_genres에 저장된 고유한 장르 목록으로 설정한다.
dummies # dummies 출력

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [85]:
# 부합하는 장르가 작성되어 있을 경우 1을 추가
for i, gen in enumerate(movies.genre) : # i와 gen값이
    ind = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, ind] = 1

In [88]:
dummies.iloc[0]

Animation      1.0
Children's     1.0
Comedy         1.0
Adventure      0.0
Fantasy        0.0
Romance        0.0
Drama          0.0
Action         0.0
Crime          0.0
Thriller       0.0
Horror         0.0
Sci-Fi         0.0
Documentary    0.0
War            0.0
Musical        0.0
Mystery        0.0
Film-Noir      0.0
Western        0.0
Name: 0, dtype: float64

In [90]:
values = rng.rand(10)
values

array([0.30668186, 0.51515877, 0.69551083, 0.28720246, 0.135766  ,
       0.55921818, 0.85464983, 0.41823209, 0.47577291, 0.28920851])

In [93]:
bin = [0., 0.2, 0.4, 0.6, 0.8, 1.]
pd.get_dummies(pd.cut(values, bin))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False        True       False       False       False
1       False       False        True       False       False
2       False       False       False        True       False
3       False        True       False       False       False
4        True       False       False       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False        True       False       False
8       False       False        True       False       False
9       False        True       False       False       False

In [95]:
val = 'a, b,          hello'
val.split(',')

['a', ' b', '          hello']

In [99]:
# ['a', 'b', 'hello']
val2 = val.split(',')
val2[2] = val2[2].strip()
val2

['a', ' b', 'hello']

In [103]:
# 또는
val2 = [x.strip() for x in val.split(',')]
val2

['a', 'b', 'hello']

In [104]:
# 'a::b::hello' (join 활용하여 합쳐주기)
"::".join(val2)

'a::b::hello'

In [105]:
# 정규 표현식
import re

text = "hello     world\t    bye    \tworld"

In [108]:
re.split("\s+", text) # \s+ : '뒷 문자를 기준으로 split을 하겠다.'를 의미한다.

['hello', 'world', 'bye', 'world']

In [111]:
# 혹은
regex = re.compile('\s+')
regex.split(text)

['hello', 'world', 'bye', 'world']

In [112]:
regex.findall(text)

['     ', '\t    ', '    \t']

In [115]:
regex.match(text) # 텍스트의 첫 문자를 기준

In [116]:
re.search('\s', text) # 그렇지 않은 부분, 첫 번째 문자열 반환

In [136]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [141]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9._-]+\.[A-Z]{2,4}' 
# 특수기호 사용 시 '\' 작성(.앞에 \쓴 것 참고)

In [142]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [144]:
regex.findall(text) # 대문자, 소문자 구분 x

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [147]:
m = regex.search(text)
m # 가장 첫 번째로 진행된 값이 나온다.

In [148]:
text[m.start():m.end()]

'dave@google.com'

In [149]:
regex.sub('이메일을 입력하시오.', text)

'Dave 이메일을 입력하시오.\nSteve 이메일을 입력하시오.\nRob 이메일을 입력하시오.\nRyan 이메일을 입력하시오.\n'

In [153]:
pattern_g = r'([A-Z0-9._%+-]+)@([A-Z0-9._-]+)\.([A-Z]{2,4})'

In [156]:
regex_g = re.compile(pattern_g, flags=re.IGNORECASE)

In [157]:
m_g = regex_g.search(text)
m_g.groups()

('dave', 'google', 'com')

In [163]:
print(m_g.group(0))
print(m_g.group(1))
print(m_g.group(2))
print(m_g.group(3))
# 그룹별 값을 가져와줄 수 있다.

dave@google.com
dave
google
com

In [165]:
regex_g.findall(text) # 해당 부분에 대한 값들을 모두 출력
# 튜플 리스트 형태로

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [180]:
data = pd.Series({"Dave" : "dave@google.com", "Steve" : "steve@gmail.com", "Rob" : "rob@gmail.com", "Ryan" : "ryan@yahoo.com", "Eric" : ""})

data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Ryan      ryan@yahoo.com
Eric
dtype: object

In [181]:
# data의 각 값에 g가 몇 개 있는지
g = data.str.count('g')

print(g)

Dave     2
Steve    1
Rob      1
Ryan     0
Eric     0
dtype: int64

In [182]:
data.map(lambda x : x.count('g'))

Dave     2
Steve    1
Rob      1
Ryan     0
Eric     0
dtype: int64

In [183]:
data[:-1].map(lambda x : x.count('g')) # count에서 np.nan이 float헝이기 때문에 count에서 에러가 난다.

Dave     2
Steve    1
Rob      1
Ryan     0
dtype: int64

In [184]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Ryan     False
Eric     False
dtype: bool

In [185]:
data.str.findall(pattern_g, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Ryan      [(ryan, yahoo, com)]
Eric                        []
dtype: object

In [187]:
data.str.extractall(pattern_g, flags=re.IGNORECASE)

                 0       1    2
      match
Dave  0       dave  google  com
Steve 0      steve   gmail  com
Rob   0        rob   gmail  com
Ryan  0       ryan   yahoo  com

In [189]:
ser = data.copy()
ser[0] = ser[0] + ', dave@naver.com'
ser # Dave의 데이터 추가

/var/folders/mr/zpw8mcz14pj_gkyqs4k_zl4c0000gn/T/ipykernel_1214/464454052.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0] = ser[0] + ', dave@naver.com'
/var/folders/mr/zpw8mcz14pj_gkyqs4k_zl4c0000gn/T/ipykernel_1214/464454052.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  ser[0] = ser[0] + ', dave@naver.com'

Dave     dave@google.com, dave@naver.com
Steve                    steve@gmail.com
Rob                        rob@gmail.com
Ryan                      ryan@yahoo.com
Eric
dtype: object

In [190]:
ser.str.extractall(pattern_g, flags=re.IGNORECASE)

                 0       1    2
      match
Dave  0       dave  google  com
      1       dave   naver  com
Steve 0      steve   gmail  com
Rob   0        rob   gmail  com
Ryan  0       ryan   yahoo  com

In [191]:
pattern_g

'([A-Z0-9._%+-]+)@([A-Z0-9._-]+)\\.([A-Z]{2,4})'

In [192]:
ser.str.get(0)

Dave       d
Steve      s
Rob        r
Ryan       r
Eric     NaN
dtype: object

In [193]:
ser.str[:-1]

Dave     dave@google.com, dave@naver.co
Steve                    steve@gmail.co
Rob                        rob@gmail.co
Ryan                      ryan@yahoo.co
Eric
dtype: object

In [215]:
data = {'age': [25, 22, np.nan, 35, 45, np.nan, 24, 60],
        'gender': ['M', 'F', 'F', 'M', 'F', 'M', 'M', 'F']}
df = pd.DataFrame(data)
df

# 연령 기반으로 구간을 나눠보자. 20대, 30대, 40대, 50대 이상
bin = [0, 29, 39, 49, np.inf] # np.inf : 무한대
labels=(['10대', '20대', '30대', '40대', '50대 이상'])

df['age_group'] = pd.cut(df['age'], bins=bin, labels=labels)
                
df

ValueError: Bin labels must be one fewer than the number of bin edges

In [217]:
# 결측치 처리 - 연령의 평균으로 대체하기
# mean_age = df['age'].mean()
# df['age'] = df['age'].fillna(mean_age)
# df

df['age'] = df['age'].fillna(df['age'].mean())
df['age'] = df['age'].round().astype(int)
print(df)

   age gender
0   25      M
1   22      F
2   35      F
3   35      M
4   45      F
5   35      M
6   24      M
7   60      F

In [218]:
# gender 부분 더미 변수 생성(one-hot encoding)
dummies = pd.get_dummies(df, columns=['gender'])
print(dummies)

   age  gender_F  gender_M
0   25     False      True
1   22      True     False
2   35      True     False
3   35     False      True
4   45      True     False
5   35     False      True
6   24     False      True
7   60      True     False